Revit 2027 API
FootPrintRoof.CurtainGrids Property
Retrieve all the CurtainGrid objects of a FootPrintRoof.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CurtainGridSet CurtainGrids { get; }
Public ReadOnly Property CurtainGrids As CurtainGridSet
	Get
public:
property CurtainGridSet^ CurtainGrids {
	CurtainGridSet^ get ();
}
member CurtainGrids : CurtainGridSet with get
Property Value
CurtainGridSet
Remarks
Only applicable when the object is a Curtain FootPrintRoof.
See Also
Reference
FootPrintRoof Class
Autodesk.Revit.DB Namespace